## 판다스 데이터프레임과 시리즈

### 시리즈 다루기 응용

#### 시리즈와 불린 추출

In [21]:
import pandas as pd

In [22]:
df = pd.read_csv('data/scientists.csv')
# 루트부터 절대경로로 써도 상관 없지 않나?!

In [23]:
df.head(2)

                Name        Born        Died  Age    Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1     William Gosset  1876-06-13  1937-10-16   61  Statistician

In [24]:
df.max()

Name          William Gosset
Born              1920-07-25
Died              1964-04-14
Age                       90
Occupation      Statistician
dtype: object

In [25]:
df['Age'].max()

90

In [26]:
# 조건에 맞으면 추출하고 아니면 마는 불린 추출
df[df['Age']>df['Age'].mean()]
# 에이지 컬럼 중에 에이지 평균보다 큰 값을 가져와

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [27]:
df['Age'].mean()

59.125

In [34]:
df['Age']>df['Age'].mean()
# 이렇게만 쓰면 True False 값으로 나옴. 값을 가져오려면 df[]로 한번 더 묶어주기

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [35]:
cond = [False, True, True, False, False, False, True, True]

In [36]:
df[cond]
# T/F 조건을 넣어서 조건에 맞는 데이터 추출

                   Name        Born        Died  Age          Occupation
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [40]:
# 직업이 chemist 인 데이터만 추출
df['Occupation'] == 'Chemist'

0     True
1    False
2    False
3     True
4    False
5    False
6    False
7    False
Name: Occupation, dtype: bool

In [41]:
df[df['Occupation']== 'Chemist']

                Name        Born        Died  Age Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37    Chemist
3        Marie Curie  1867-11-07  1934-07-04   66    Chemist

In [42]:
df[df['Occupation'] != 'Chemist']

                   Name        Born        Died  Age          Occupation
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

#### 시리즈와 브로드캐스팅

In [44]:
# df['Age']>df['Age'].mean() 이것도 사실 브로드캐스팅 된 거임. 평균값은 하나고 에이지값은 여러개니까 평균이 브로드캐스팅 돼서 하나하나 비교함
df['Age'] + 100

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [45]:
df['Age'] + pd.Series([1,100])

# pd.Series([1,100])가 값이 두개니까 에이지에서도 두개만 더함. 나머지는 구냥 Null값이 들어감.. 딱히 오류가 나지는 않는다

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [46]:
# sort
df['Age'].sort_index() # 인덱스 기준으로 정렬하겠다

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

df.sort_index(
    axis: 'Axis' = 0,
    level: 'Level | None' = None,
    ascending: 'bool | int | Sequence[bool | int]' = True,
    inplace: 'bool' = False,    저장을 따로 하지 않겠다
    kind: 'str' = 'quicksort',
    na_position: 'str' = 'last',
    sort_remaining: 'bool' = True,
    ignore_index: 'bool' = False,
    key: 'IndexKeyFunc' = None,
)

In [48]:
df['Age'].sort_index(ascending=False)

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [50]:
df.sort_values(by='Age', ascending=False)
# sort_values 값 기준으로 정렬하겠다
# 나이가 많은 순으로 정렬

                   Name        Born        Died  Age          Occupation
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist

### 시리즈와 데이터프레임의 데이터 처리하기

In [54]:
# 열의 자료형 바꾸기와 새로운 열 추가하기
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 448.0+ bytes

In [56]:
# 1876-06-13의 데이터타입이 지금은 오브젝트인데 datetime 타입으로 바꾸기

pd.to_datetime(df['Born'])
# to_datetime 문자열을 날짜로
# to_numeric 문자열을 숫자로
# timedelta 날짜 간격을 객체로 만들 때? 뭔말이죠

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

[참고. 날짜,시간 데이터타입](https://docs.python.org/3/library/datetime.html#strftime-and-strptime-behavior)

In [63]:
df['Born_dt'] = pd.to_datetime(df['Born'], format='%Y-%m-%d')
df['Died_dt'] = pd.to_datetime(df['Died'], format='%Y-%m-%d')

In [64]:
df.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'Born_dt', 'Died_dt'], dtype='object')

In [65]:
df.head(2)

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16

In [66]:
df['Died_dt'] - df['Born_dt']

0   13779 days
1   22404 days
2   32964 days
3   24345 days
4   20777 days
5   16529 days
6   15324 days
7   28422 days
dtype: timedelta64[ns]

In [67]:
import random

In [69]:
random.seed(42)
# seed값을 주면 고정?

In [70]:
random.shuffle(df['Age'])
# 에이지값을 랜덤으로섞어줘. 값이 바뀌어버리네

C:\Users\user\anaconda3\lib\random.py:362: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x[i], x[j] = x[j], x[i]

In [71]:
df

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,66,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,56,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,41,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,77,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,90,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,37,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,61,Mathematician,1777-04-30,1855-02-23

In [72]:
# 데이터프레임의 열 삭제하기
df.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'Born_dt', 'Died_dt'], dtype='object')

In [73]:
df.drop(columns='Age')
# 에이지 컬럼을 기준으로 제거하겠다. 
# 제거한 값을 리턴해주는데 원본이 변경된 건 아님. 원본 변경 하고 싶으면 inplace=True 주면 됨

,Name,Born,Died,Occupation,Born_dt,Died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,Mathematician,1777-04-30,1855-02-23

### 데이터 저장하고 불러오기

데이터를 피클, csv, tsv 파일로 저장하고 불러오기
제이슨은 텍스트기반이라 그냥 열어서 봐도 보임
피클 저장하는법이나 제이슨 저장하는 법 비슷하대여

In [75]:
df

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,66,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,56,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,41,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,77,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,90,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,37,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,61,Mathematician,1777-04-30,1855-02-23

In [76]:
import pickle

In [81]:
f = open('data.pickle', 'wb')
# 파일 열어주는 거 ??? 
# wb 쓰깊파일, 바이트.... 바이트타입이란건가

pickle.dump(df, f)
f.close()
# dump 저장하는거
# load 읽어오는거
# dump vs dumps dumps는 메모리상에 올라온 거. 그냥 dump는 파일로 돼있는거

In [82]:
f = open('data.pickle', 'rb')
data = pickle.load(f)
f.close()

In [83]:
data

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,66,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,56,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,41,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,77,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,90,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,37,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,61,Mathematician,1777-04-30,1855-02-23

In [84]:
import json

In [85]:
df['Name'].to_list()

['Rosaline Franklin',
 'William Gosset',
 'Florence Nightingale',
 'Marie Curie',
 'Rachel Carson',
 'John Snow',
 'Alan Turing',
 'Johann Gauss']

In [86]:
f = open('data.json', 'w')
json.dump(df['Name'].to_list(), f)
f.close()
# 제이슨 저장도 똑같다. 데이터프레임을 제이슨으로 만들 수는 없어서 리스트 가져와서 제이슨으로 저장함

In [87]:
f = open('data.json', 'r')
data = json.load(f)
f.close()

In [88]:
data

['Rosaline Franklin',
 'William Gosset',
 'Florence Nightingale',
 'Marie Curie',
 'Rachel Carson',
 'John Snow',
 'Alan Turing',
 'Johann Gauss']

In [89]:
df

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,66,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,56,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,41,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,77,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,90,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,37,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,61,Mathematician,1777-04-30,1855-02-23

시리즈와 데이터프레임을 엑셀파일로 저장하기

In [90]:
import openpyxl

In [94]:
!pip install xlwt
# 셀에서 xlwt 바로 설치

Collecting xlwt
  Downloading xlwt-1.3.0-py2.py3-none-any.whl (99 kB)
     -------------------------------------- 100.0/100.0 kB 5.6 MB/s eta 0:00:00
Installing collected packages: xlwt
Successfully installed xlwt-1.3.0

In [95]:
import xlwt
# xlsx 말고 xls 쓰려면 필요

In [96]:
df.to_excel('df_excel.xls')

C:\Users\user\AppData\Local\Temp\ipykernel_12080\1042641208.py:1: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  df.to_excel('df_excel.xls')

In [93]:
df.to_excel('df_excel.xlsx')

In [ ]:
pd.read_excel()
# 파일명
# 시트이름(첫 시트가 아니면)